Revit 2026 API

# AdvancedWoodWoodFiberPerlinProf Property

---

The property labeled "Profile for fiber perlin noise" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodFiberPerlinProf { get; }
```
```vb
Public Shared ReadOnly Property WoodFiberPerlinProf As String
	Get
```
```cpp
public:
static property String^ WoodFiberPerlinProf {
	String^ get ();
}
```
```fsharp
static member WoodFiberPerlinProf : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace